Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength.#ctor(Autodesk.Revit.DB.ElementId)
Create a constraint to drive chord length.
paramId:
The Id of a Rebar Shape parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
A constraint that can be applied to a RebarShapeDefinitionByArc
and drives the straight distance between the arc endpoints.
Since:
2012